{"id":5116,"date":"2019-04-16T20:52:30","date_gmt":"2019-04-16T20:52:30","guid":{"rendered":"http:\/\/atr1.wpengine.com\/?page_id=5116"},"modified":"2019-04-25T17:22:28","modified_gmt":"2019-04-25T17:22:28","slug":"how-to-optimize-your-job-search","status":"publish","type":"page","link":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/","title":{"rendered":"How to Optimize Your Job Search"},"content":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; css=&#8221;.vc_custom_1547348123343{padding-top: 30vh !important;padding-bottom: 20vh !important;background-image: url(http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/01\/Capture10.jpg?id=1332) !important;background-position: center !important;background-repeat: no-repeat !important;background-size: cover !important;}&#8221; el_class=&#8221;custom-overlay gradient-overlay&#8221;][vc_column css_animation=&#8221;fadeIn&#8221;][vc_row_inner][vc_column_inner width=&#8221;1\/4&#8243;][\/vc_column_inner][vc_column_inner width=&#8221;1\/2&#8243;][vc_column_text]<\/p>\n<h1 style=\"text-align: center; font-size: 56px; color: #fff; font-weight: 300; max-width: 600px; margin: 0 auto;\"><strong>How to Optimize<br \/>\nYour Job Search<\/strong><\/h1>\n<h2 style=\"text-align: center; font-size: 30px; color: #fff; font-weight: 300; max-width: 600px; margin: 0 auto;\"><strong>A Comprehensive Guide for<br \/>\nEvery Job Seeker<\/strong><\/h2>\n<p>[\/vc_column_text][\/vc_column_inner][vc_column_inner width=&#8221;1\/4&#8243;][\/vc_column_inner][\/vc_row_inner][\/vc_column][\/vc_row][vc_row full_height=&#8221;yes&#8221; content_placement=&#8221;middle&#8221;][vc_column css_animation=&#8221;fadeIn&#8221; css=&#8221;.vc_custom_1548113358585{padding-top: 120px !important;}&#8221;][vc_column_text]<\/p>\n<h2 style=\"font-size: 40px; margin: 0 auto; margin-bottom: 20px; padding: 0 20px; max-width: 800px; text-align: center;\">Introduction<\/h2>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">Landing a new job is exciting. Finding a new job is work. Whether you’re actively looking for a new position, planning a future career move, or wondering what else is out there, all the “stuff” you have to do can seem daunting. Just the thought of updating your resume can stop you in your tracks.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">We’re not going to lie to you – it does take some effort. Some parts of the job search can be annoying, seem redundant, or both. But there is no way of avoiding it if you want to find a good job and have an interesting, prosperous career. The good news is we’re here to help.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">We’ve been recruiting and placing people at leading companies for over 25 years. We’ve learned a thing or two about the job search and we’re happy to share our knowledge with you. We’ve learned that the process is much easier if you know what you’re doing and employ some best practices. We’ve got information that will help you create a great resume that gets you noticed, networking strategies to find an “in” at your dream company, and tips on how to ace that interview.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">Finding ATR International was the first step. Keep reading and take the next steps on the path to a great new job and an exciting career.<\/p>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row content_placement=&#8221;middle&#8221; css_animation=&#8221;fadeIn&#8221; css=&#8221;.vc_custom_1548113366168{padding-top: 90px !important;padding-bottom: 100px !important;}&#8221;][vc_column width=&#8221;1\/2&#8243;][vc_column_text]<\/p>\n<h3 style=\"margin-bottom: 5px; max-width: 460px; font-size: 20px; font-weight: bold;\">A Brief History of the Resume<\/h3>\n<p>The resume has a long history, not surprising since it is such a useful document. From Leonardo Da Vinci to you, the present day job seeker, the resume quickly and succinctly presents the story of your career.<\/p>\n<p><strong>Read: <\/strong><a href=\"http:\/\/blog.atrinternational.com\/3-things-job-seekers-can-learn-from-leonardo-da-vincis-resume\">3 Things Job Seekers Can Learn From DaVinci&#8217;s Resume<\/a><\/p>\n<p>&nbsp;<\/p>\n<p>We may all bemoan the challenges of creating a resume, and agree on its shortcomings, but despite constant predictions of its demise, the resume is here to stay. Over time it has changed its format and content, and responded to technological advances, but one thing remains the same:<\/p>\n<p>You need one, and one that works.<\/p>\n<p>Keep reading to learn about best practices in <a href=\"http:\/\/blog.atrinternational.com\/the-best-resume-advice-all-in-one-place\" target=\"_blank\" rel=\"noopener\">creating a resume that tells the story of you in the best possible way<\/a>.<\/p>\n<p>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;5121&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][\/vc_row][vc_row][vc_column]<\/p>\n<div class=\"templatera_shortcode\">\n<div data-vc-full-width=\"true\" data-vc-full-width-init=\"false\" data-vc-stretch-content=\"true\" class=\"vc_row wpb_row vc_row-fluid blue-overlay custom-overlay padding-top-100 padding-bottom-120 vc_custom_1551306755291 vc_row-has-fill vc_row-no-padding\">\n<div class=\"wpb_column vc_column_container vc_col-sm-12\">\n<div class=\"vc_column-inner\">\n<div class=\"wpb_wrapper\">\n<div class=\"wpb_text_column wpb_content_element \" >\n<div class=\"wpb_wrapper\">\n<h3 class=\"header-main\" style=\"margin: 0px auto 10px; padding: 0px 10px; max-width: 700px; color: #ffffff; text-align: center;\"><span style=\"font-size: 28pt;\">Your resume is almost always the first time a company is learning about who you are and what you do. Make sure it’s perfect.<br \/>\n<\/span><\/h3>\n<\/p><\/div>\n<\/p><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"vc_row-full-width vc_clearfix\"><\/div>\n<\/div>\n<p>[\/vc_column][\/vc_row][vc_row el_class=&#8221;padding-top-100&#8243;][vc_column css_animation=&#8221;fadeIn&#8221;][vc_column_text]<\/p>\n<h1 style=\"text-align: center;\">Creating a Resume<\/h1>\n<p>&nbsp;<\/p>\n<p>There are two things to think about when you create your resume &#8211; format and content. It’s as simple as that, and we are going to make it even easier. <a href=\"http:\/\/blog.atrinternational.com\/how-to-format-your-resume-for-todays-recruiting-technology\" target=\"_blank\" rel=\"noopener\">No fancy formatting<\/a>. No complex layouts. None. Zero. Nada. Have we made our opinion clear?<\/p>\n<p>&nbsp;<\/p>\n<p>We hate to sound stern but this is a really important point. Absolutely nothing like that is necessary. It is actually bad and can be counterproductive to your job search. Why? Because of applicant tracking systems (ATS). All companies use them and ATSs, or any software designed to scan and parse resume data, doesn’t like fancy formatting. Colors, tables, boxes, and pictures can cause issues and will likely mean your resume is somewhat jumbled after the ATS parses it and uploads the results into the hiring company’s database. And a jumbled resume may not accurately show up when a recruiter performs searches, thereby reducing your chances to be considered for open positions. This is exactly what you don’t want! Keep your resume format simple.<\/p>\n<p><strong>Read:<\/strong> <a href=\"http:\/\/blog.atrinternational.com\/9-absolute-donts-for-your-resume\" target=\"_blank\" rel=\"noopener\">9 Absolute Don&#8217;ts for Your Resume<\/a><\/p>\n<p>&nbsp;<\/p>\n<p>Choose a simple, readable font, such as Verdana, Arial, Tahoma, or Calibri. Avoid serif fonts like Times or Cambria. And left justify your text. Keep it simple so that the system can easily read your resume. And it’s not just software, recruiters who actually look at a resume and not your profile in an ATS, spend less than 10-15 seconds reviewing a resume before moving on. Make sure yours is easy to read in that small window. Gimmicky formats that “stand out” or look “unique” are almost always something to avoid because they overshadow the actual content of the resume. And if a recruiter has to search for content, they will likely move on. You may also want search on specific types of resumes that match your skill set. For example: &#8220;accounting resumes&#8221;, &#8220;marketing resumes&#8221;, or &#8220;technical resumes&#8221;.<\/p>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column]<\/p>\n<div class=\"templatera_shortcode\">\n<div data-vc-full-width=\"true\" data-vc-full-width-init=\"false\" data-vc-stretch-content=\"true\" class=\"vc_row wpb_row vc_row-fluid blue-overlay custom-overlay padding-top-100 padding-bottom-120 vc_custom_1551306755291 vc_row-has-fill vc_row-no-padding\">\n<div class=\"wpb_column vc_column_container vc_col-sm-12\">\n<div class=\"vc_column-inner\">\n<div class=\"wpb_wrapper\">\n<div class=\"wpb_text_column wpb_content_element \" >\n<div class=\"wpb_wrapper\">\n<h3 class=\"header-main\" style=\"margin: 0px auto 10px; padding: 0px 10px; max-width: 700px; color: #ffffff; text-align: center;\"><span style=\"font-size: 28pt;\">Microsoft Word offers resume templates. There are many to choose from but remember to<br \/>\nkeep it simple. Or you can simply download one of our favorites.<\/span><\/h3>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><a class=\"button button-green\" href=\"http:\/\/www.atrinternational.com\/careernetwork\/search.php\" target=\"_self\">Download Resume Template<\/a><\/p>\n<\/p><\/div>\n<\/p><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"vc_row-full-width vc_clearfix\"><\/div>\n<\/div>\n<p>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h2 style=\"text-align: center;\"><strong>Resume Font<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">One recent study found that resumes that used a font size of 11 got more interviews than those of any other size. Unfortunately, the study did not mention the font type. But the best fonts to use are the most legible, sans-serif fonts and include Verdana, Arial, Tahoma, or Calibri. Avoid serif fonts like Times, Cambria, Georgia, and Garamond to minimize the possibility of errors when your resume is scanned by ATS resume parsing software. And it will be scanned.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-5129 size-full\" src=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png\" alt=\"\" width=\"583\" height=\"251\" srcset=\"https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png 583w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3-300x129.png 300w\" sizes=\"(max-width: 583px) 100vw, 583px\" \/><\/p>\n<p>[\/vc_column_text]<\/p>\n<div class=\"templatera_shortcode\">\n<div data-vc-full-width=\"true\" data-vc-full-width-init=\"false\" data-vc-stretch-content=\"true\" class=\"vc_row wpb_row vc_row-fluid blue-overlay custom-overlay padding-top-100 padding-bottom-120 vc_custom_1551306755291 vc_row-has-fill vc_row-no-padding\">\n<div class=\"wpb_column vc_column_container vc_col-sm-12\">\n<div class=\"vc_column-inner\">\n<div class=\"wpb_wrapper\">\n<div class=\"wpb_text_column wpb_content_element \" >\n<div class=\"wpb_wrapper\">\n<h3 class=\"header-main\" style=\"margin: 0px auto 10px; padding: 0px 10px; max-width: 700px; color: #ffffff; text-align: center;\"><span style=\"font-size: 18pt;\">The content of your resume will take the most time to get right. But it is time well spent.<br \/>\n<\/span><\/h3>\n<\/p><\/div>\n<\/p><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"vc_row-full-width vc_clearfix\"><\/div>\n<\/div>\n<p>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h2 style=\"text-align: center;\"><strong>Resume Content<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p>So now that you have decided on a format, what about content? Of course you need to include the basics such as contact information and the dates and length of your specific employment. The trickier part is how to present your actual work experience. A reliable way to develop good content is to use the PAR approach. Problem, Action, Result. Think about a Problem that occurred at work, what Action did you take, and what was the Result. For example:<\/p>\n<p>&nbsp;<\/p>\n<p><i><strong>P<\/strong>roblem: Sitting down and completing the paperwork for the on-boarding process was consistently given a poor rating by new hires.<\/i><\/p>\n<p><i><strong>A<\/strong>ction: After much research, I moved the process online allowing new hires to complete and submit the paperwork on their own time.<\/i><\/p>\n<p><i><strong>R<\/strong>esult: This not only improved the rating by new hires but also improved the accuracy of the paperwork.<\/i><\/p>\n<p>Now you have a great bullet point to add to your resume. It could read something like this:<\/p>\n<p><i>Optimized the onboarding process by moving the paperwork online and implementing e-signature capabilities. This reduced errors to almost zero and increased the survey rating of the process.<\/i><\/p>\n<p>Continue to think of problems that you helped solve or actions that resulted in tangible results and you will have some great content for your resume in no time.<\/p>\n<p><strong>Read:<\/strong> <a href=\"http:\/\/blog.atrinternational.com\/your-resume-writing-a-better-work-history-section\" target=\"_blank\" rel=\"noopener\">How to Write the Perfect Work History Section<br \/>\n<\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Pro Tip:<\/strong> Use the PAR technique to create compelling content for your resume.<\/p>\n<p>Here is an example that further emphasizes how to write good PAR statements for your resume. It is from <i>My Personal Formula for a Winning Resume<\/i>, by Laszlo Bock, former SVP, People Operations at Google.<\/p>\n<p><i>Okay (original version)<br \/>\n<\/i><i>Studied financial performance of companies and made investment recommendations.<\/i><\/p>\n<p><i>Much Better (edited version)<br \/>\n<\/i><i>Improved portfolio performance by 12% ($1.2M) over one year by refining cost of capital calculations for information-poor markets and re-weighting portfolio based on resulting valuations.<\/i><\/p>\n<p>As Bock points out, the addition of the “12% improvement” makes the statement more powerful. Adding “($1.2M)” anticipates the reviewer’s question about whether 12% is a big deal or not. Explaining how you did it adds credibility and gives insight into your strengths.<\/p>\n<p><strong>Read:<\/strong> <a href=\"http:\/\/blog.atrinternational.com\/dont-be-so-opinionated\" target=\"_blank\" rel=\"noopener\">Keep Your Opinions Out of Your Resume<\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Gaps<\/strong><br \/>\nGaps in your work experience aren’t necessarily an issue unless you don’t take the time to explain them. Things like taking time off for raising family, company layoff, taking care of ill family members, furthering education, etc. are all acceptable if they are dealt with honestly. A hiring company wants to know that your time off was for a legitimate reason and not simply sitting on the couch all day watching Netflix.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Customize<\/strong><br \/>\nEach resume you send out should be customized for the position. Each role you are applying for is slightly different and companies use slightly different terms and titles. Be sure to tailor your resume accordingly based on the job description and requirements.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Proofread<\/strong><br \/>\nOnce you are done, be sure to proofread it. And then proofread it again. And then find the most detail oriented person you know and have them proofread it. Errors in resumes are often viewed as unacceptable and can result in your resume being rejected no matter how qualified you are for a position. So don’t let all of your hard work go to waste over a punctuation or spelling mistake. And remember, spell check won’t catch everything.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Applicant Tracking Systems\/Resume Parsers<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p>We said it above and we’re saying it again, most companies use some sort of ATS to help manage resumes and streamline the recruiting process. In addition to thinking about <a href=\"http:\/\/blog.atrinternational.com\/how-to-format-your-resume-for-todays-recruiting-technology\">format and the ATS<\/a>, you have to think about content too. These systems look for certain pieces of information in a resume like keywords, dates, and location, and often score or rank your resume against the company’s current job openings. All of this automation might sound discouraging, but like anything else in life, with the right approach it can be used to your advantage. Here are the basic steps your resume will follow when submitted to a job posting at a large company.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"padding-left: 30px;\">1.  HR\/Recruiting receives your resume in conjunction with many others who have applied for a position.<\/p>\n<p style=\"padding-left: 30px;\">2.  Your resume is run through a parser (possibly even before it is viewed by human eyes).<\/p>\n<p style=\"padding-left: 30px;\">3.  The parser removes all styling and converts your resume into strings of characters for further processing.<\/p>\n<p style=\"padding-left: 30px;\">4.  The parsing software groups the strings of characters into categories like education, experience, skills, and contact information before loading into a database.<\/p>\n<p style=\"padding-left: 30px;\">5.  Internal recruiters search the database using keywords and terms.<\/p>\n<p style=\"padding-left: 30px;\">6.  The ATS scores your resume based on the search and displays your profile along with other candidates and their designated score.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-5134 size-full\" src=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/parser_flow_2.png\" alt=\"\" width=\"939\" height=\"166\" srcset=\"https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/parser_flow_2.png 939w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/parser_flow_2-300x53.png 300w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/parser_flow_2-768x136.png 768w\" sizes=\"(max-width: 939px) 100vw, 939px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>So what does all this mean for your job search and specifically, your resume?<\/p>\n<p>&nbsp;<\/p>\n<p>Luckily, resume parsing software and their search and scoring features are getting better all the time and are quickly moving from strictly using keywords to a more “human-like” search intelligence. This technology is similar to search engines like Google, which now understands a searcher&#8217;s “intent” and is able to offer up better, more targeted search results. But it’s virtually impossible to know what type of ATS each company you apply to is using.<\/p>\n<p>&nbsp;<\/p>\n<p>So ultimately, you want to make sure your resume contains certain keywords and phrases associated with the position you want. This is another reason why customizing your resume for each position is important. Make sure that your resume contains keywords from the job description; it’s a great way to enhance your odds of being noticed. And remember, make sure that your resume is formatted simply, legibly, and is written for a human to easily understand.<\/p>\n<p>&nbsp;<\/p>\n<p>How do you figure out those key words and phrases?<\/p>\n<p>&nbsp;<\/p>\n<p>Here is some further guidance from The Resume Help blog:<\/p>\n<p>&nbsp;<\/p>\n<p>Priority resume keywords are words used in the company&#8217;s listed job title, used in the description headlines, used more than twice, and called out as success criteria.<\/p>\n<p>&nbsp;<\/p>\n<p>Secondary resume keywords are the mention of competitor companies or brand name experience, keyword phrases (phrases surrounding priority keywords), and notable industry qualifications (training, associations).<\/p>\n<p>&nbsp;<\/p>\n<p>Jobscan and Resunate are great sites that will help you optimize your resume for ATS software. They function in a slightly different way but are simple, effective, and most importantly, help you get positive results. Either one is a good tool to use before submitting your resume to a company for consideration.<\/p>\n<p><strong>Pro Tip:<\/strong> Customize your resume for each position that you apply for.<\/p>\n<p>&nbsp;<\/p>\n<p>[\/vc_column_text]<\/p>\n<div class=\"templatera_shortcode\">\n<div data-vc-full-width=\"true\" data-vc-full-width-init=\"false\" data-vc-stretch-content=\"true\" class=\"vc_row wpb_row vc_row-fluid blue-overlay custom-overlay padding-top-100 padding-bottom-120 vc_custom_1551306755291 vc_row-has-fill vc_row-no-padding\">\n<div class=\"wpb_column vc_column_container vc_col-sm-12\">\n<div class=\"vc_column-inner\">\n<div class=\"wpb_wrapper\">\n<div class=\"wpb_text_column wpb_content_element \" >\n<div class=\"wpb_wrapper\">\n<h3 class=\"header-main\" style=\"margin: 0px auto 10px; padding: 0px 10px; max-width: 700px; color: #ffffff; text-align: center;\"><span style=\"font-size: 12pt;\">Our clients are some of the best companies in the country. Send us a copy of your resume to see if they are<br \/>\nlooking for someone like you. Our placement services are always free for job seekers.<\/span><\/h3>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><a class=\"button button-green\" href=\"http:\/\/www.atrinternational.com\/cs\/c\/?cta_guid=03bd74e1-5efa-4732-a3ff-d08bc88fdac1&amp;placement_guid=335044b4-7c03-482f-ab12-3aa572fc8ff0&amp;portal_id=128828&amp;canon=http%3A%2F%2Fwww.atrinternational.com%2Fhow-to-optimize-your-job-search&amp;redirect_url=APefjpGvKs13Vlv4Dy2CS-hQrCkHqayJBrR_PYG_gkn1j7np56sFfVwe147ouGa0ub3SzCMxhl52KnH1Zfc5gY8W9gtpdDyFn4e51EPl2aUycrJaLw2Rmf-X-aCMaoCcFXH7nwztQeFvt6ekLo11A9i0O_5N42vwoX-iiuyOXBYetfYji7b9xGSDIidhVk0N3e0ZcKp9HJjxY8LgPSJjKPIH0FE6-TJQaOcvYh2xO56yjkCKgJCr4rUp9HKRUh7GuDyWb1pubCKeHkwLNRhQQeo_qNvkEyOs0A&amp;click=5bbd2ad9-e115-4ba9-b2d5-80bab63e0854&amp;hsutk=100c47cb8ab4a1fb5a7d013c6aa3b8fa&amp;pageId=5192760212&amp;__hstc=49460857.100c47cb8ab4a1fb5a7d013c6aa3b8fa.1555442375737.1555442375737.1555442375737.1&amp;__hssc=49460857.1.1555442375737&amp;__hsfp=420343025\" target=\"_self\">Click Here to Submit Resume<\/a><\/p>\n<\/p><\/div>\n<\/p><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"vc_row-full-width vc_clearfix\"><\/div>\n<\/div>\n<p>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h2 style=\"text-align: center;\"><strong><br \/>\n<a id=\"JobBoards\"><\/a>Job Boards<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">If you are looking for a job you should monitor all of the most popular job sites. But keep in mind that only 18% of external hires are attributed to job sites. So while it’s important to utilize them, they should only be part of your overall strategy. Most job sites where you post your resume also allow you to create a search and save it. The site will then send you daily emails with any jobs that fit your job search criteria (e.g., company, keywords, job title). This is a great time saver. Here are the best job sites.<\/p>\n<h3 style=\"text-align: center;\"><strong><br \/>\nAggregators<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">These “job boards” are basically job search engines, single topic search engines with the topic being jobs. They are similar to Google in that they crawl the web and pull in jobs from thousands of sites including job boards, staffing firms, and company pages. Aside from searching for a job, aggregators offer a variety of very helpful services for job seekers. Here are the two most popular job aggregators.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-5138 size-full\" src=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/aggregators.png\" alt=\"\" width=\"679\" height=\"101\" srcset=\"https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/aggregators.png 679w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/aggregators-300x45.png 300w\" sizes=\"(max-width: 679px) 100vw, 679px\" \/><\/p>\n<p>&nbsp;<\/p>\n<h3 style=\"text-align: center;\"><strong>Traditional Job Boards<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">Traditional job boards facilitate job hunting and range from large scale general sites to niche job boards for job categories such as IT, legal, government, non-profit, etc. Users can typically create a profile and upload their resume so that they can easily apply for posted jobs and also be found by recruiters accessing the site. Jobs posted to these boards are paid for by the employers. There are many, but here are a few.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-5139 size-full\" src=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/job-boards2.jpg\" alt=\"\" width=\"1179\" height=\"131\" srcset=\"https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/job-boards2.jpg 1179w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/job-boards2-300x33.jpg 300w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/job-boards2-768x85.jpg 768w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/job-boards2-1024x114.jpg 1024w\" sizes=\"(max-width: 1179px) 100vw, 1179px\" \/><\/p>\n<h3 style=\"text-align: center;\"><strong>Social Media<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">Social Media encompasses many platforms, and some are more or less useful to a job seeker, but all deserve consideration. Many companies advertise jobs through Facebook, Instagram or Twitter. Companies need help! They are looking for good employees and they’re exploring all communication platforms to reach them. Do the same and check out the companies you want to work for on social media. You never know how you may end up connecting with a great job!<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">LinkedIn is a bit of a hybrid but certainly falls into the social media category. They have job postings as well. It is also one of the go to sites for recruiters looking for talent. Because of this, make sure your LinkedIn profile is thorough and accurate. Use it to put yourself and your experience in the best light possible. Recruiters are viewing your profile. Use that to your advantage. You can read more about optimizing your use of LinkedIn in the social media section.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-5140 size-full\" src=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/linkedin-logo.png\" alt=\"\" width=\"283\" height=\"82\" \/><\/p>\n<h3 style=\"text-align: center;\"><strong>LinkedIn has over 300 million users in 200 different countries,<\/strong><\/h3>\n<h3 style=\"text-align: center;\"><strong>and 40% of those users log in on a daily basis.<\/strong><\/h3>\n<p>[\/vc_column_text][vc_separator]<\/p>\n<div class=\"templatera_shortcode\">\n<div data-vc-full-width=\"true\" data-vc-full-width-init=\"false\" data-vc-stretch-content=\"true\" class=\"vc_row wpb_row vc_row-fluid blue-overlay custom-overlay padding-top-100 padding-bottom-120 vc_custom_1551306755291 vc_row-has-fill vc_row-no-padding\">\n<div class=\"wpb_column vc_column_container vc_col-sm-12\">\n<div class=\"vc_column-inner\">\n<div class=\"wpb_wrapper\">\n<div class=\"wpb_text_column wpb_content_element \" >\n<div class=\"wpb_wrapper\">\n<h3 class=\"header-main\" style=\"margin: 0px auto 10px; padding: 0px 10px; max-width: 700px; color: #ffffff; text-align: center;\"><span style=\"font-size: 12pt;\">Our clients are some of the best companies in the country. Send us a copy of your resume to see if they are<br \/>\nlooking for someone like you. Our placement services are always free for job seekers.<\/span><\/h3>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><a class=\"button button-green\" href=\"http:\/\/www.atrinternational.com\/cs\/c\/?cta_guid=03bd74e1-5efa-4732-a3ff-d08bc88fdac1&amp;placement_guid=335044b4-7c03-482f-ab12-3aa572fc8ff0&amp;portal_id=128828&amp;canon=http%3A%2F%2Fwww.atrinternational.com%2Fhow-to-optimize-your-job-search&amp;redirect_url=APefjpGvKs13Vlv4Dy2CS-hQrCkHqayJBrR_PYG_gkn1j7np56sFfVwe147ouGa0ub3SzCMxhl52KnH1Zfc5gY8W9gtpdDyFn4e51EPl2aUycrJaLw2Rmf-X-aCMaoCcFXH7nwztQeFvt6ekLo11A9i0O_5N42vwoX-iiuyOXBYetfYji7b9xGSDIidhVk0N3e0ZcKp9HJjxY8LgPSJjKPIH0FE6-TJQaOcvYh2xO56yjkCKgJCr4rUp9HKRUh7GuDyWb1pubCKeHkwLNRhQQeo_qNvkEyOs0A&amp;click=5bbd2ad9-e115-4ba9-b2d5-80bab63e0854&amp;hsutk=100c47cb8ab4a1fb5a7d013c6aa3b8fa&amp;pageId=5192760212&amp;__hstc=49460857.100c47cb8ab4a1fb5a7d013c6aa3b8fa.1555442375737.1555442375737.1555442375737.1&amp;__hssc=49460857.1.1555442375737&amp;__hsfp=420343025\" target=\"_self\">Click Here to Submit Resume<\/a><\/p>\n<\/p><\/div>\n<\/p><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"vc_row-full-width vc_clearfix\"><\/div>\n<\/div>\n<p>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h3 style=\"text-align: center;\"><strong>Networking for a Job<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p>Networking encompasses several things that you can do to help you find and get the right position – maybe even your dream job. First, you want to think about who you know that can help you – friends, relatives, former colleagues, classmates – keeping in mind how discrete or open you want to be about your job search. The more people who know that you are looking for a job and what you are hoping to find, the more likely they’ll connect you with a good opportunity.<\/p>\n<p>&nbsp;<\/p>\n<p>If there are particular industries or companies where you would like to work and you have a connection to someone there, obviously those are great networking opportunities. They can let you know if there are openings at their firm or give you advice on what companies to look at within the industry. If you find a job on a job board and know someone that works there, ask them if they would be willing to forward your resume to the hiring manager and\/or HR. You should also apply on line but this kind of recommendation can help get your resume noticed and hopefully lead to an interview.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><strong>Pro Tip:<\/strong> Most job boards have a feature that allows you to block anyone at your current<br \/>\ncompany from finding your resume. Be sure to use this feature if<br \/>\nyou want to keep your job search from your current employer.<\/p>\n<p>&nbsp;<\/p>\n<p>Networking is also where LinkedIn comes into play since one of its best features is the ability to quickly see who in your network is connected to a company that you are interested in and might help you learn more about career opportunities there. The power of LinkedIn is also that it allows you to see if someone in your network has someone in their network that works at that firm. Tapping into your network&#8217;s connections increases exponentially the possibility of finding a way in. Just because someone is connected doesn&#8217;t mean they can help you but it&#8217;s worth a try.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><strong>According to the Bureau of Labor Statistics, 70% of all<\/strong><\/p>\n<p style=\"text-align: center;\"><strong>jobs are found through networking.<\/strong><\/p>\n<p><strong>Be Proactive<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>Searching current open positions is one way to be proactive but another strategy, more of a long term approach, is to determine which companies you’d like to work for and approach them whether or not they have a current job opening. Using LinkedIn, the goal is to find someone within the organization who has decision making capabilities and make them aware that you admire their company and are interested in joining their team. This is relatively easy to do and can yield very good, long term results. Here are the steps:<strong><br \/>\n<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p style=\"padding-left: 30px;\">1.  Optimize your LinkedIn profile under the assumption that it will be viewed. (see the Social Media section)<\/p>\n<p style=\"padding-left: 30px;\">2.  Create a spreadsheet and list the companies where you would like to work.<\/p>\n<p style=\"padding-left: 30px;\">3.  Use LinkedIn to find someone who is senior level in the department that is the best fit for your skill set. Add them to the spreadsheet.<\/p>\n<p style=\"padding-left: 30px;\">4.  Reach out to these individuals via LinkedIn or through email.<\/p>\n<h3 style=\"text-align: center;\"><strong>LinkedIn<\/strong><\/h3>\n<p>The easiest way to communicate with someone you are not connected to is to send an invitation to connect with a simple message:<\/p>\n<p style=\"padding-left: 30px;\"><i>Hi Melissa,<\/i><\/p>\n<p style=\"padding-left: 30px;\"><i>I wanted to reach out to you to see if your team is in need of an industry vet. I am currently putting out feelers for a career move and have always had the utmost respect for Company XYZ. Perhaps we can have a phone conversation or meet for lunch if there is interest.<\/i><\/p>\n<p style=\"padding-left: 30px;\"><i>Best regards,<br \/>\n<\/i><i>Mike<\/i><\/p>\n<p>&nbsp;<\/p>\n<p>The goal here is to pique their interest. Give them just enough to get them to look at your LinkedIn profile, which of course is set up to blow them away. The worst case scenario is that they aren’t interested and move on. No harm done. The best case scenario is that they reach out to you or forward your message on to someone else to reach out to you. So there is very little downside and significant upside. You may need an email address to send an invitation. If that’s the case, use the next tip to find their email address.<\/p>\n<h3 style=\"text-align: center;\"><strong>Email<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p>Sending a brief email (rather than a LinkedIn message) using the same message above is also an option. But how do you find their email address? Here is a trick that works most of the time. Let’s use XYZ Networks as an example.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"padding-left: 30px;\">1.  Check XYZ Network’s website URL to see how their domain name is structured. In this case, let&#8217;s use “xyz.net”.<\/p>\n<p style=\"padding-left: 30px;\">2.  Do a search on “@xyz.net email”<\/p>\n<p style=\"padding-left: 30px;\">3.  You will then find email addresses for XYZ Network employees. For example, firstname.lastname@xyz.net.<\/p>\n<p style=\"padding-left: 30px;\">4.  Now you know the structure for XYZ Network&#8217;s email addresses.<\/p>\n<p style=\"padding-left: 30px;\">5.  You can now go back to your contact’s name and figure out, with pretty good accuracy, what their email address is.<\/p>\n<p>&nbsp;<\/p>\n<p>Note that this approach is not 100% accurate. But you should be able to get the right email address approximately 80% of the time. Larger companies often use multiple email structures because they may have employees with the same name.<\/p>\n<p>&nbsp;<\/p>\n<p>Acting proactively in this way will probably not land you an immediate job, but it will get you noticed by decision makers at companies where you want to work. And if you can connect with these decision makers on LinkedIn you have created a scenario where they will be able to see and learn more about you based on your LinkedIn activity. It’s a great way to build a network of people who can help you advance your career.<\/p>\n<p style=\"padding-left: 30px;\"><strong>Pro Tip:<\/strong> Working with the right staffing firm can get your resume<\/p>\n<p style=\"padding-left: 30px;\">in front of hiring managers at leading companies.<\/p>\n<p>[\/vc_column_text]<\/p>\n<div class=\"templatera_shortcode\">\n<div data-vc-full-width=\"true\" data-vc-full-width-init=\"false\" data-vc-stretch-content=\"true\" class=\"vc_row wpb_row vc_row-fluid blue-overlay custom-overlay padding-top-100 padding-bottom-120 vc_custom_1551306755291 vc_row-has-fill vc_row-no-padding\">\n<div class=\"wpb_column vc_column_container vc_col-sm-12\">\n<div class=\"vc_column-inner\">\n<div class=\"wpb_wrapper\">\n<div class=\"wpb_text_column wpb_content_element \" >\n<div class=\"wpb_wrapper\">\n<h3 class=\"header-main\" style=\"margin: 0px auto 10px; padding: 0px 10px; max-width: 700px; color: #ffffff; text-align: center;\"><span style=\"font-size: 12pt;\">One of the most overlooked aspects of a job search is utilizing staffing firms. Of course you might expect us to say that! But seriously, there are reasons why a staffing firm can be a big help to a job seeker, and whether you choose us or another firm, we want you to know the benefits.Staffing firms have the one thing you won’t find anywhere else in your job search, unless you have a connection, a company insider you know pretty well, and that is established relationships with companies that are hiring. In many cases, a staffing firm will have a long term relationship where the staffing firm knows the ins-and-outs of the company and is fully trusted to source, screen, and place employees. This is a relationship that you want to take advantage of.Staffing firms are also motivated to provide quality candidates, like you, to their clients. This is how they get paid. So a good staffing firm will be happy to hear from a qualified candidate and will assign you to a specialized recruiter who can help you with your resume, interviewing, etc. at no cost to you. They want to place you just as much as you want to find a job.<br \/>\nIn your search for the right firm, you will want to find one that places candidates who are in the same category as you. Marketing, Accounting, IT or whatever your category happens to be, there are sure to be several staffing firms that can help. Make the effort to find them, it will be worth your time.<\/span><\/h3>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><a class=\"button button-green\" href=\"http:\/\/www.atrinternational.com\/cs\/c\/?cta_guid=03bd74e1-5efa-4732-a3ff-d08bc88fdac1&amp;placement_guid=335044b4-7c03-482f-ab12-3aa572fc8ff0&amp;portal_id=128828&amp;canon=http%3A%2F%2Fwww.atrinternational.com%2Fhow-to-optimize-your-job-search&amp;redirect_url=APefjpGvKs13Vlv4Dy2CS-hQrCkHqayJBrR_PYG_gkn1j7np56sFfVwe147ouGa0ub3SzCMxhl52KnH1Zfc5gY8W9gtpdDyFn4e51EPl2aUycrJaLw2Rmf-X-aCMaoCcFXH7nwztQeFvt6ekLo11A9i0O_5N42vwoX-iiuyOXBYetfYji7b9xGSDIidhVk0N3e0ZcKp9HJjxY8LgPSJjKPIH0FE6-TJQaOcvYh2xO56yjkCKgJCr4rUp9HKRUh7GuDyWb1pubCKeHkwLNRhQQeo_qNvkEyOs0A&amp;click=5bbd2ad9-e115-4ba9-b2d5-80bab63e0854&amp;hsutk=100c47cb8ab4a1fb5a7d013c6aa3b8fa&amp;pageId=5192760212&amp;__hstc=49460857.100c47cb8ab4a1fb5a7d013c6aa3b8fa.1555442375737.1555442375737.1555442375737.1&amp;__hssc=49460857.1.1555442375737&amp;__hsfp=420343025\" target=\"_self\">Click Here to Submit Resume<\/a><\/p>\n<\/p><\/div>\n<\/p><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"vc_row-full-width vc_clearfix\"><\/div>\n<\/div>\n<p>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h2 style=\"text-align: center;\"><strong>Job Interviews<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p>There are two basic types of job interviews: in-person and phone interviews. Increasingly, video interviews are becoming more common. Let’s take a look at <a href=\"http:\/\/blog.atrinternational.com\/bid\/174745\/Be-Prepared-The-Interview-Checklist\" target=\"_blank\" rel=\"noopener\">how to prepare for all types of job interviews<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<h3 style=\"text-align: center;\"><strong>In-Person Interviews<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p><strong>Research<\/strong><br \/>\nOne of the first, and most important, things to do once you land an interview is to begin researching. Research the company. Research the industry. Research their competitors. Research the person\/people interviewing you. Research everything you can possibly think of that is associated with the company. It’s always better to be over than under prepared.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Practice<\/strong><br \/>\nAs the old adage goes, practice makes perfect. Do you know someone in HR? or maybe a recruiter? Give them a copy of the job description and ask them to interview you. Tell them to ask the difficult questions. The ones that could trip you up. Practice is the best way to build confidence and confidence is an important key to a successful interview. You can find sample job interview questions online and use those to prepare as well.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Dress Properly<\/strong><br \/>\nThe job interview is the place to impress the hiring manager and your attire is part of the package. You want to convey a clean, put-together, professional look that says you are the one for the job. If you think casual clothing is appropriate for the interview, be sure to verify from multiple sources. Just because the business environment is casual or employees dress casually doesn&#8217;t necessarily mean you should dress casual for your interview. When in doubt, the default outfit should be a suit or on the more professional side than casual.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"padding-left: 30px;\"><i>Pants<br \/>\n<\/i>If the job doesn&#8217;t warrant wearing a business suit, opt for slacks, dress pants, or a business-like skirt or dress. Make sure items are clean, pressed and fit correctly. Wear a belt if necessary. Don’t allow clothing to sag or for hems to drag on the ground.<\/p>\n<p style=\"padding-left: 30px;\"><i>Shirt<br \/>\n<\/i>In a very casual environment, you can pair slacks or a skirt with a clean, pressed button-down, long sleeve shirt. For men, pair a conservative tie with a button down, knowing you can easily remove it if you end up feeling overdressed. Don’t wear t-shirts or collarless shirts, which can come across as too casual.<\/p>\n<p style=\"padding-left: 30px;\"><i>Jacket<br \/>\n<\/i>If you aren’t wearing a suit, a sports jacket that coordinates with your slacks or skirt is appropriate. Choose a jacket that comfortably buttons at the waist, allowing you to unbutton for casual and re-button for a slightly more professional look. For men, always leave the bottom button undone on any jacket with two or more buttons.<\/p>\n<p style=\"padding-left: 30px;\"><i>Shoes<br \/>\n<\/i>Clean, polished dress shoes are appropriate to pair with slacks, although a casual shoe like a loafer will also work with khakis. Match sock color to shoe color. For women, go with professional and understated. Think mid-heel, closed-toe pump. And wear hosiery when appropriate based on industry, weather, and geography.<\/p>\n<p style=\"padding-left: 30px;\"><i>Accessories<br \/>\n<\/i>Other than a watch, men&#8217;s accessories paired with casual business attire are not appropriate. For women, a conservative necklace, ring, or bracelet is appropriate. Everyone should carry a simple portfolio with copies of your resume.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"padding-left: 150px;\"><strong>Pro Tip:<\/strong> Studies have shown that the clothes you wear to an interview<br \/>\nare just as important as what you say in the interview.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Grooming<\/strong><i><br \/>\n<\/i>For men, shower, shave, and clean and file fingernails. If you wear glasses, be sure to clean the lenses. For women, manicured nails with a neutral polish is best. Also, basic, professional make-up is the best option. Hair should be neatly groomed and pulled back, away from the face.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bring Resumes<\/strong><br \/>\nBe sure to get a simple portfolio or folder and slip a few copies of your resume inside. You probably won’t need them but if the interviewer is in a rush and forgets to print out your resume, you will be able to save the day. You will also want to bring a pen and some paper just in case you need to write something down.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Arrive Early<\/strong><br \/>\nGet to the interview location 5 to 10 minutes early. This shows that you are punctual and respectful of others time.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Firm Handshake<\/strong><br \/>\nGive a nice, firm handshake to anyone that you meet at the company and be sure to smile and make eye contact. First impressions are everything.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Be Consultative<\/strong><br \/>\nUltimately, the company has a need and are considering you to fill that need. One very effective way to approach the job interview is to think of yourself as a consultant who is there to solve whatever that need might be. Ask questions about the role, what are the challenges around the role, what the role needs to accomplish, etc. Then offer your thoughts, possible solutions, ways you’ve seen things done elsewhere, etc. to show that you would be a great fit for the role. However, be sure to listen just as much as you speak. This is a great way to turn the interview into a conversation that puts you front-and-center as the perfect candidate to fill their need.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-5147 size-full\" src=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/question_bubbles_2.png\" alt=\"\" width=\"738\" height=\"460\" srcset=\"https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/question_bubbles_2.png 738w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/question_bubbles_2-300x187.png 300w\" sizes=\"(max-width: 738px) 100vw, 738px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Ask the Interviewer Questions<br \/>\n<\/strong><a href=\"http:\/\/blog.atrinternational.com\/bid\/163741\/9-Questions-You-Should-Ask-an-Interviewer\" target=\"_blank\" rel=\"noopener\">Always have a few questions prepared<\/a> for that inevitable, end of the interview moment, when the interviewer asks if you have any questions. You may have questions that arise as part of the job interview, which is great. Asking good questions about the job itself or to get more information about something specific you and the interviewer discussed shows that you are paying attention and think carefully about things. But if nothing like that has happened, then bring out your prepared questions. This is the time to ask things that may not be directly related to the role. Things like:<\/p>\n<p style=\"padding-left: 30px;\">•  How do employees develop and learn at company XYZ?<\/p>\n<p style=\"padding-left: 30px;\">•  Why is the position open?<\/p>\n<p style=\"padding-left: 30px;\">•  How does the company review performance?<\/p>\n<p style=\"padding-left: 30px;\">•  What do you enjoy most about working here?<\/p>\n<p>Never ask any questions about salary, benefits, etc. These should be saved for when an offer is made.<i><br \/>\n<\/i><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Thank You<\/strong><i><br \/>\n<\/i><a href=\"http:\/\/blog.atrinternational.com\/bid\/131571\/After-the-Job-Interview\" target=\"_blank\" rel=\"noopener\">Follow up any job interview that same day or evening with a thank you<\/a> email. Keep it short and sweet, thanking the interviewer for their time and letting them know your interest level in the position. If the interviewer does not receive a “thank you,” they will often assume you are not interested in the position. See the Follow Up section for more details.<\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Phone Interviews<br \/>\n<\/strong><\/h3>\n<p>A <a href=\"http:\/\/blog.atrinternational.com\/the-must-dos-of-phone-and-video-interviews\" target=\"_blank\" rel=\"noopener\">phone interview<\/a> is very similar to an in-person interview and almost identical in what you should do to prepare. You will want to research the company, practice, take a consultative approach, and ask questions. Please refer to the In-Person Interview section above for details on each of these points. But as similar as it is, there are some unique aspects to the phone interview that you need to be aware of.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Good Reception<\/strong><br \/>\nIf you are taking the call on a cell phone, be sure that you are in a location that affords you good reception. The last thing you want is to have the interview disrupted by static or the inability to understand what the interviewer is asking. If possible, use a landline for the interview to avoid any possibility of this problem.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Quiet<\/strong><br \/>\nFind somewhere quiet, no matter what kind of phone you are using. No one likes to have a conversation with someone when there is background noise interfering with what is being said. Sit in your car and roll up the windows if necessary, but make sure there is no chance of an interruption and no background noise.<\/p>\n<p><strong>Read:<\/strong> <a href=\"http:\/\/blog.atrinternational.com\/bid\/197584\/25-Really-Odd-Interview-Questions\" target=\"_blank\" rel=\"noopener\">25 Really Odd Interview Questions<\/a><\/p>\n<p>&nbsp;<\/p>\n<h3 style=\"text-align: center;\"><strong>Video Interviews<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p>A <a href=\"http:\/\/blog.atrinternational.com\/the-must-dos-of-phone-and-video-interviews\">video interview<\/a> is also very similar to an in-person interview, again almost identical in what you should do to prepare, including dressing as if you are interviewing in person. As with the phone interview you need to make sure you are in a quiet place without distractions. Make sure that the desk or table that you are sitting at, as well as whatever is behind you that will appear on camera, is clear and free from clutter. Make sure no one will walk behind you during the interview.<\/p>\n<p>&nbsp;<\/p>\n<p>It’s also a good idea to test your equipment and make sure your webcam and microphone are working properly. During the job interview, look directly into the camera and not at the computer screen. This will ensure that on the other end, you will be looking at the interviewer as if you are across the table from them. Finally, speak slowly and clearly and be aware of the slight delay that occurs in transmitting. Pause a little longer than normal at times to give the interviewer a chance to interject.<\/p>\n<p>&nbsp;<\/p>\n<p>[\/vc_column_text]<\/p>\n<div class=\"templatera_shortcode\">\n<div data-vc-full-width=\"true\" data-vc-full-width-init=\"false\" data-vc-stretch-content=\"true\" class=\"vc_row wpb_row vc_row-fluid blue-overlay custom-overlay padding-top-100 padding-bottom-120 vc_custom_1551306755291 vc_row-has-fill vc_row-no-padding\">\n<div class=\"wpb_column vc_column_container vc_col-sm-12\">\n<div class=\"vc_column-inner\">\n<div class=\"wpb_wrapper\">\n<div class=\"wpb_text_column wpb_content_element \" >\n<div class=\"wpb_wrapper\">\n<h3 class=\"header-main\" style=\"margin: 0px auto 10px; padding: 0px 10px; max-width: 700px; color: #ffffff; text-align: center;\"><span style=\"font-size: 28pt;\">Send us a copy of your resume today. Our placement services are always free for job seekers.<\/span><\/h3>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><a class=\"button button-green\" href=\"http:\/\/blog.atrinternational.com\/resume-submittal?hsCtaTracking=335044b4-7c03-482f-ab12-3aa572fc8ff0%7C03bd74e1-5efa-4732-a3ff-d08bc88fdac1\" target=\"_self\">Click Here to Submit Resume<\/a><\/p>\n<\/p><\/div>\n<\/p><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"vc_row-full-width vc_clearfix\"><\/div>\n<\/div>\n<p>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h2 style=\"text-align: center;\"><strong>Social Media and Your Job Search<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<h3 style=\"text-align: center;\"><strong>LinkedIn<\/strong><\/h3>\n<p>Your LinkedIn profile is almost equally as important as your resume and a critical part of your job search. Every recruiter or HR professional who reviews your resume will then check your LinkedIn profile, so make sure it is complete and professional before you send out that first email or apply online.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Profile<\/strong><br \/>\nYou need, at a minimum, eight things to have a complete profile and reach All-Star status on LinkedIn.<\/p>\n<p style=\"padding-left: 60px;\">1.  Your name<br \/>\n2.  Current title<br \/>\n3.  Industry and location<br \/>\n4.  Two past positions<br \/>\n5.  Education<br \/>\n6.  At least three listed skills<br \/>\n7.  At Least 50 connections<br \/>\n8.  A photo (make sure it’s professional)<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Summary<\/strong><br \/>\nThe Summary section is where you really sell yourself. It is often the first thing an employer reads about you so it’s important to be clear and concise. The word limit for the Summary section is 2,000 but anything over 200 is too much. Potential employers don’t want to read thousands of words to figure out what you do. You can go into more detail in the Experience section of your profile. Here is a great example of a LinkedIn Summary from Danny Rubin of News to Live By.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-5149 size-full\" src=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/LinkedIn_summary_3.png\" alt=\"\" width=\"584\" height=\"400\" srcset=\"https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/LinkedIn_summary_3.png 584w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/LinkedIn_summary_3-300x205.png 300w\" sizes=\"(max-width: 584px) 100vw, 584px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>Just as important as what goes into your Summary, is knowing what to leave out. There are certain buzzwords that are a no-no for any LinkedIn Summary. They are overused and hackneyed and strike a sour note with most recruiters. Just don’t use them.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-5150 size-full\" src=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/linkedin_taboo_words2.png\" alt=\"\" width=\"660\" height=\"249\" srcset=\"https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/linkedin_taboo_words2.png 660w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/linkedin_taboo_words2-300x113.png 300w\" sizes=\"(max-width: 660px) 100vw, 660px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Section Arrangement<\/strong><br \/>\nLinkedIn allows you to rearrange the sections of your profile. So, for example, if you have awards or certifications that you want to highlight, you can move them closer to the top of your profile. Only utilize this feature if there is a very obvious change that would make your profile more appealing.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Profile Background Image<\/strong><br \/>\nIt is now possible to add a background image to the top of your profile. The recommended dimensions are 1400 x 425 pixels. Only use this feature if you have a high resolution image that enhances your profile.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Publicly Viewable<\/strong><br \/>\nYou will see a blue button next to your profile picture that reads “View profile as.” Click on the down arrow next to it and choose the last selection, “Manage public profile settings.” On this page you will be able to check boxes to determine what sections are publicly viewable. At the very least, make your picture, headline, and summary viewable. Other sections can be made viewable as well if it makes sense to your job search.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Experience<\/strong><br \/>\nThis section should closely emulate your resume. It’s where you go into more depth about your role and accomplishments for each of your positions. Pull content from your resume to complete this section.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Other Sections<\/strong><br \/>\nLinkedIn offers other sections for your profile including Volunteering Opportunities (42% of hiring managers surveyed said they view volunteer experience equal to formal work experience), Honors &amp; Awards, Certifications, Projects, and many others. Look through them and populate any that can aid in branding you in a positive light to any prospective employer.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Media<\/strong><br \/>\nThe Summary section and the Experience section both allow you to add media to further emphasize your accomplishments. You can add images, files, video, documents, etc. Take advantage where appropriate but be careful. Only share appropriate, professional content.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Recommendations<\/strong><br \/>\nA LinkedIn recommendation is a comment written by a LinkedIn member to recognize or commend your work. The best recommendations come from individuals who have first-hand knowledge of your work such as managers, colleagues, co-workers, customers, and clients. Writing recommendations for others is a great way to get them to recommend you. You can also request a recommendation by moving your cursor over your photo at the top right of your homepage and select Privacy &amp; Settings. Under the Helpful Links section, select Manage your recommendations. Click the Ask for recommendations tab at the top of the page and follow the prompts.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Groups<\/strong><br \/>\nMake an effort to join any group that is a fit for your expertise or industry experience. The greatest benefit to joining groups is that you can message fellow members even if you aren’t a first degree connection. In addition, group members are able to view the profiles of other members without being connected.<\/p>\n<h3 style=\"text-align: center;\"><strong>All Other Social Media<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p>Unless <a href=\"http:\/\/blog.atrinternational.com\/social-media-privacy-settings-and-your-job-search\">your other social media accounts<\/a> are dedicated strictly to your professional life, it’s best to simply adjust your security settings to the maximum so they are not viewable by the general public. This includes <a href=\"http:\/\/blog.atrinternational.com\/bid\/130345\/Facebook-and-Your-Job-Search\">Facebook<\/a>, Pinterest, Instagram, Twitter, Google +, and others. It just isn’t appropriate to share personal details of your life with prospective employers and rather than helping you get a job, it is more likely to be a hindrance. This approach also ensures that your LinkedIn profile will be the go-to social media presence every employer uses to learn more about you, giving you maximum control over the message you want to communicate.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-5151 size-full\" src=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/social-media-icons-2.jpg\" alt=\"\" width=\"480\" height=\"360\" srcset=\"https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/social-media-icons-2.jpg 480w, https:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/social-media-icons-2-300x225.jpg 300w\" sizes=\"(max-width: 480px) 100vw, 480px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>[\/vc_column_text]<\/p>\n<div class=\"templatera_shortcode\">\n<div data-vc-full-width=\"true\" data-vc-full-width-init=\"false\" data-vc-stretch-content=\"true\" class=\"vc_row wpb_row vc_row-fluid blue-overlay custom-overlay padding-top-100 padding-bottom-120 vc_custom_1551306755291 vc_row-has-fill vc_row-no-padding\">\n<div class=\"wpb_column vc_column_container vc_col-sm-12\">\n<div class=\"vc_column-inner\">\n<div class=\"wpb_wrapper\">\n<div class=\"wpb_text_column wpb_content_element \" >\n<div class=\"wpb_wrapper\">\n<h3 class=\"header-main\" style=\"margin: 0px auto 10px; padding: 0px 10px; max-width: 700px; color: #ffffff; text-align: center;\"><span style=\"font-size: 18pt;\">80% of recruiters hire through LinkedIn and more than 90% of those search for, contact, and screen candidates based on their profiles.<br \/>\n<\/span><\/h3>\n<\/p><\/div>\n<\/p><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"vc_row-full-width vc_clearfix\"><\/div>\n<\/div>\n<p>[\/vc_column][\/vc_row][vc_row css=&#8221;.vc_custom_1551381948186{margin-top: 50px !important;}&#8221;][vc_column][\/vc_column][\/vc_row][vc_row][vc_column][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h2 style=\"text-align: center;\"><strong>Job Interview Follow Up<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p>Handwritten notes are no longer considered necessary or appropriate. They are viewed as archaic in today’s fast moving world. Instead, follow-up with an email to each person who interviewed you and thank them for their time. Be sure your follow-up email is sent within 24 hours or on the same day when possible. Also, take extra time to proofread your email. A good practice is to write the email immediately after the interview and then come back to it a few hours later to read it with a fresh pair of eyes. Another way to minimize errors is to send it to a friend for review or use a free grammar check software like Grammarly.<\/p>\n<p>Here is an example of a follow-up email:<\/p>\n<p style=\"padding-left: 60px;\"><i>Dear Steve,<\/i><\/p>\n<p style=\"padding-left: 60px;\"><i>Thank you for an interesting conversation today about content marketing and your need for a Marketing Manager. I was happy to meet you, Robin, and Andrea. I’m looking forward to continuing the discussion and learning more about what’s in the plans for the future of marketing at Biogen.<\/i><\/p>\n<p style=\"padding-left: 60px;\"><i>Best regards,<br \/>\n<\/i><i>Larry Blake<\/i><\/p>\n<p>It’s okay to follow up one more time approximately a week later if you have not heard back. An email similar to this should work fine.<\/p>\n<p style=\"padding-left: 60px;\"><i>Hi Steve,<\/i><\/p>\n<p style=\"padding-left: 60px;\"><i>I just wanted to follow up in regards to my interview on Tuesday of last week. Do you have an update, or do you need any further information from me? Please let me know at your earliest convenience.<\/i><\/p>\n<p style=\"padding-left: 60px;\"><i>Thank you,<br \/>\n<\/i><i>Larry Blake<\/i><\/p>\n<p>Any further contact becomes risky. <a href=\"http:\/\/blog.atrinternational.com\/bid\/137195\/The-Job-Interview-Why-Didn-t-They-Call-You-Back-and-What-To-Do\">If you haven’t received a reply yet<\/a>, the company has either gone with another candidate or has put things on hold. While<a href=\"http:\/\/blog.atrinternational.com\/bid\/181058\/Are-You-Sure-That-s-Why-You-Didn-t-Get-Hired\">it is frustrating not to hear back<\/a>, know that you’ve done everything possible under your control. <a href=\"http:\/\/blog.atrinternational.com\/job-rejection-should-never-be-taken-personally\">Try not to take it too personally<\/a>. It’s probably best to move on to other opportunities at this point knowing that they will contact you when\/if they feel the need.<\/p>\n<p>[\/vc_column_text]<\/p>\n<div class=\"templatera_shortcode\">\n<div data-vc-full-width=\"true\" data-vc-full-width-init=\"false\" data-vc-stretch-content=\"true\" class=\"vc_row wpb_row vc_row-fluid blue-overlay custom-overlay padding-top-100 padding-bottom-120 vc_custom_1551306755291 vc_row-has-fill vc_row-no-padding\">\n<div class=\"wpb_column vc_column_container vc_col-sm-12\">\n<div class=\"vc_column-inner\">\n<div class=\"wpb_wrapper\">\n<div class=\"wpb_text_column wpb_content_element \" >\n<div class=\"wpb_wrapper\">\n<h3 class=\"header-main\" style=\"margin: 0px auto 10px; padding: 0px 10px; max-width: 700px; color: #ffffff; text-align: center;\"><span style=\"font-size: 28pt;\">Send us a copy of your resume today. Our placement services are always free for job seekers.<\/span><\/h3>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><a class=\"button button-green\" href=\"http:\/\/blog.atrinternational.com\/resume-submittal?hsCtaTracking=335044b4-7c03-482f-ab12-3aa572fc8ff0%7C03bd74e1-5efa-4732-a3ff-d08bc88fdac1\" target=\"_self\">Click Here to Submit Resume<\/a><\/p>\n<\/p><\/div>\n<\/p><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"vc_row-full-width vc_clearfix\"><\/div>\n<\/div>\n<p>[\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<div class=\"row-fluid-wrapper row-depth-1 row-number-27 \">\n<div class=\"row-fluid \">\n<div class=\"span12 widget-span widget-type-rich_text \" data-widget-type=\"rich_text\" data-x=\"0\" data-w=\"12\">\n<div class=\"cell-wrapper layout-widget-wrapper\">\n<h2 style=\"text-align: center;\"><strong>Getting a Job Offer<\/strong><\/h2>\n<h4 style=\"text-align: center;\">Congratulations, you got an offer. But don&#8217;t accept it just yet.<\/h4>\n<p><strong><br \/>\nConsideration<\/strong><br \/>\nYou most likely have already considered the basic prospects of working for the company that has extended you an offer for employment. But the offer you received most likely has information you may not have been aware of. Items such as the details of the benefits including their 401(k), medical coverage, number of vacation days, etc. This is the time to do a complete review of the offer to see if it is truly a fit for your career path. Really <a href=\"http:\/\/blog.atrinternational.com\/why-you-must-understand-your-company-culture\">think about the culture and personality of the company<\/a> and whether or not it matches yours and will truly offer the right overall experience for you. If you haven’t already done so, now is a good time to review online ratings and reviews of the company by current and former employees. If you know someone at the company, discreetly and appropriately speak with them about what it’s like to work there.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Questions<\/strong><br \/>\nNow is the time to get all of your questions answered. Make sure you are clear on issues related to the position, the offer, and the company. Many times important things are only touched on during the interview. Now that there is a concrete offer, it’s time to get into the details. For example, how much travel will be required? Will you have an expense account? Is overtime expected? Can you telecommute? Profit sharing and bonuses? Whether it is a permanent or contract position, be sure every question is answered and every concern addressed before you make a final decision.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Accepting the Offer<\/strong><br \/>\nIf everything related to the position meets your needs, it’s time to formally accept the offer. Once you let your new employer know your intentions, they should send you some type of legal agreement. Make sure you have this before giving notice to your current employer.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Giving Notice<\/strong><br \/>\nOnce you have a written agreement for your new position, give two weeks notice to your existing employer. They may accept the two weeks or they may choose to end your employment earlier. Be flexible and make every effort to not burn any bridges. Also, be respectful of your employer’s wishes with regards to informing your colleagues that you are leaving. Some companies may want management informing others of your departure.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"row-fluid-wrapper row-depth-1 row-number-28 \">\n<div class=\"row-fluid \">\n<div class=\"span12 widget-span widget-type-rich_text \" data-widget-type=\"rich_text\" data-x=\"0\" data-w=\"12\">\n<div class=\"cell-wrapper layout-widget-wrapper\">\n<p><strong>About ATR International<\/strong><br \/>\nFounded in 1988, ATR International is a leading provider of enterprise-wide staffing services. We are headquartered in Silicon Valley and serve clients across the U.S.<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_column_text]<\/p>\n<p>We have long term relationships with many leading companies. <strong><span style=\"text-decoration: underline;\">Send us your resume<\/span> <\/strong>to see if our clients need someone like you!<\/p>\n<p>[\/vc_column_text][vc_icon icon_fontawesome=&#8221;fa fa-download&#8221; size=&#8221;lg&#8221; align=&#8221;center&#8221; link=&#8221;url:http%3A%2F%2Fblog.atrinternational.com%2Fresume-submittal|title:Submit%20your%20Resume||&#8221;][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_column_text]<\/p>\n<div class=\"page\" title=\"Page 33\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<p><strong>Browse our jobs<\/strong> to see if we have something that is a fit for you. Connect directly with a recruiter once you find that perfect fit.<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p>[\/vc_column_text][vc_icon icon_fontawesome=&#8221;fa fa-search&#8221; size=&#8221;lg&#8221; align=&#8221;center&#8221; link=&#8221;url:http%3A%2F%2Fatrjobs.com%2Fcareernetwork%2Fsearch.php%3F__hstc%3D49460857.100c47cb8ab4a1fb5a7d013c6aa3b8fa.1555442375737.1555442375737.1555442375737.1%26__hssc%3D49460857.1.1555442375737%26__hsfp%3D420343025|||&#8221;][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"Send us a copy of your resume today. Our placement services are always free for job seekers. &nbsp; Click Here to Submit Resume","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"content-type":"","footnotes":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.2 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Optimize Your Job Search<\/title>\n<meta name=\"description\" content=\"Our recruiters offer tried and tested advice on your job search. Learn about optimizing resumes, social media, interviewing, networking, and more.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Optimize Your Job Search\" \/>\n<meta property=\"og:description\" content=\"Our recruiters offer tried and tested advice on your job search. Learn about optimizing resumes, social media, interviewing, networking, and more.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/\" \/>\n<meta property=\"og:site_name\" content=\"ATR International\" \/>\n<meta property=\"article:modified_time\" content=\"2019-04-25T17:22:28+00:00\" \/>\n<meta property=\"og:image\" content=\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"34 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/\",\"url\":\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/\",\"name\":\"How to Optimize Your Job Search\",\"isPartOf\":{\"@id\":\"https:\/\/www.atrinternational.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#primaryimage\"},\"thumbnailUrl\":\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png\",\"datePublished\":\"2019-04-16T20:52:30+00:00\",\"dateModified\":\"2019-04-25T17:22:28+00:00\",\"description\":\"Our recruiters offer tried and tested advice on your job search. Learn about optimizing resumes, social media, interviewing, networking, and more.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#primaryimage\",\"url\":\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png\",\"contentUrl\":\"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.atrinternational.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to Optimize Your Job Search\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.atrinternational.com\/#website\",\"url\":\"https:\/\/www.atrinternational.com\/\",\"name\":\"ATR International\",\"description\":\"Celebrating over 32 years as a staffing and consulting leader\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.atrinternational.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Optimize Your Job Search","description":"Our recruiters offer tried and tested advice on your job search. Learn about optimizing resumes, social media, interviewing, networking, and more.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/","og_locale":"en_US","og_type":"article","og_title":"How to Optimize Your Job Search","og_description":"Our recruiters offer tried and tested advice on your job search. Learn about optimizing resumes, social media, interviewing, networking, and more.","og_url":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/","og_site_name":"ATR International","article_modified_time":"2019-04-25T17:22:28+00:00","og_image":[{"url":"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"34 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/","url":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/","name":"How to Optimize Your Job Search","isPartOf":{"@id":"https:\/\/www.atrinternational.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#primaryimage"},"image":{"@id":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#primaryimage"},"thumbnailUrl":"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png","datePublished":"2019-04-16T20:52:30+00:00","dateModified":"2019-04-25T17:22:28+00:00","description":"Our recruiters offer tried and tested advice on your job search. Learn about optimizing resumes, social media, interviewing, networking, and more.","breadcrumb":{"@id":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#primaryimage","url":"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png","contentUrl":"http:\/\/www.atrinternational.com\/wp-content\/uploads\/2019\/04\/font_resume_3.png"},{"@type":"BreadcrumbList","@id":"https:\/\/www.atrinternational.com\/how-to-optimize-your-job-search\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.atrinternational.com\/"},{"@type":"ListItem","position":2,"name":"How to Optimize Your Job Search"}]},{"@type":"WebSite","@id":"https:\/\/www.atrinternational.com\/#website","url":"https:\/\/www.atrinternational.com\/","name":"ATR International","description":"Celebrating over 32 years as a staffing and consulting leader","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.atrinternational.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"_links":{"self":[{"href":"https:\/\/www.atrinternational.com\/wp-json\/wp\/v2\/pages\/5116"}],"collection":[{"href":"https:\/\/www.atrinternational.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.atrinternational.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.atrinternational.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.atrinternational.com\/wp-json\/wp\/v2\/comments?post=5116"}],"version-history":[{"count":0,"href":"https:\/\/www.atrinternational.com\/wp-json\/wp\/v2\/pages\/5116\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.atrinternational.com\/wp-json\/wp\/v2\/media?parent=5116"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}